In [1]:
import pandas as pd
pd.__version__

'1.2.3'

In [2]:
df=pd.DataFrame([[12,25,2017,10],[1,15,2018,11]],columns=['month'
,'day','year','hour'])
df

   month  day  year  hour
0     12   25  2017    10
1      1   15  2018    11

In [3]:
pd.to_datetime(df)

0   2017-12-25 10:00:00
1   2018-01-15 11:00:00
dtype: datetime64[ns]

In [5]:
pd.to_datetime(df[['month','day','year']])

0   2017-12-25
1   2018-01-15
dtype: datetime64[ns]

# create a category column

In [6]:
drinks=pd.read_csv('drinks_by_country.txt')
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [7]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [9]:
#old way
drinks['continent']=drinks.continent.astype('category')
drinks.dtypes

country                           object
beer_servings                      int64
spirit_servings                    int64
wine_servings                      int64
total_litres_of_pure_alcohol     float64
continent                       category
dtype: object

In [11]:
#new way
drinks=pd.read_csv('drinks_by_country.txt',dtype={'continent':'category'})
drinks.dtypes

country                           object
beer_servings                      int64
spirit_servings                    int64
wine_servings                      int64
total_litres_of_pure_alcohol     float64
continent                       category
dtype: object

In [12]:
#old way
drinks['beer_servings']=drinks.beer_servings.astype('float')
drinks['spirit_servings']=drinks.spirit_servings.astype('float')
drinks.dtypes

country                           object
beer_servings                    float64
spirit_servings                  float64
wine_servings                      int64
total_litres_of_pure_alcohol     float64
continent                       category
dtype: object

In [13]:
# new way
drinks=drinks.astype({'beer_servings':'float','spirit_servings':'float'})
drinks.dtypes

country                           object
beer_servings                    float64
spirit_servings                  float64
wine_servings                      int64
total_litres_of_pure_alcohol     float64
continent                       category
dtype: object

# apply multiple aggregation

In [14]:
drinks.groupby('continent').beer_servings.mean()

continent
Africa            61.471698
Asia              37.045455
Europe           193.777778
North America    145.434783
Oceania           89.687500
South America    175.083333
Name: beer_servings, dtype: float64

In [15]:
drinks.groupby('continent').beer_servings.agg(['min','max','mean'])

                min    max        mean
continent
Africa          0.0  376.0   61.471698
Asia            0.0  247.0   37.045455
Europe          0.0  361.0  193.777778
North America   1.0  285.0  145.434783
Oceania         0.0  306.0   89.687500
South America  93.0  333.0  175.083333

In [16]:
drinks.beer_servings.agg(['mean','max','min'])

mean    106.160622
max     376.000000
min       0.000000
Name: beer_servings, dtype: float64

In [17]:
drinks.agg(['mean','max','min'])

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
max,Zimbabwe,376.000000,438.000000,370.000000,14.400000
min,Afghanistan,0.000000,0.000000,0.000000,0.000000
mean,NaN,106.160622,80.994819,49.450777,4.717098

In [19]:
drinks.describe()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,106.160622,80.994819,49.450777,4.717098
std,101.143103,88.284312,79.697598,3.773298
min,0.000000,0.000000,0.000000,0.000000
25%,20.000000,4.000000,1.000000,1.300000
50%,76.000000,56.000000,8.000000,4.200000
75%,188.000000,128.000000,59.000000,7.200000
max,376.000000,438.000000,370.000000,14.400000